# 必要なライブラリをインポートする
import streamlit as st
import numpy as np
import pandas as pd

# 仮想環境の起動
# > [仮想環境名]\Scripts\activate.bat → 例）.stlit39\Scripts\activate.bat

# Streamlitアプリの起動
# > streamlit run [.pyのファイル名] → 例） streamlit run stapp01.py 

# サーバへのアクセス方法
# > Local URL: をブラウザで起動する

# コードの変更時
# > ブラウザの画面をリロードすると、変更が反映されます

# 終了方法
# > (Ctrl) + (c)キー

#=============================================================================#
# 以降のコードは順次、レッスン単位でコメントアウトを解除しながら試してください
#-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-#

# # Streamlitの基礎:レッスン1
# # 文字を表示する
st.title('レッスン1')           # タイトル
st.header('レッスン1')          # ヘッダ
st.subheader('レッスン1')       # サブヘッダ

lines = """st.subheader('レッスンexec')"""

exec(lines)

# st.caption('レッスン1')         # キャプション
# st.code('print("レッスン1"')    # ソースコード
# st.write('レッスン1')           # 汎用的な出力
# st.latex('S_{t+1}=S_{t}\exp(\mu \Delta_t+\sigma \sqrt{\Delta_t}\epsilon_t)')    # 数式（ラテック形式/tex:テフ）

# # Streamlitの基礎:レッスン2
# # 数値を入力する
# n = st.number_input(label='数値を入力してください', value=7)
# st.write(n)

# # Streamlitの基礎:レッスン3
# # 簡単な計算を実行する
# n1 = st.number_input(label='数値1を入力してください', value=0)
# n2 = st.number_input(label='数値2を入力してください', value=7)
# n3 = n1 + n2
# mess = '数値1＋数値2＝' + str(n3)
# st.write(mess)


#=============================================================================#
#
# 課題. 簡単な計算機を作成しよう
# 初級（必須）：2つの数の足し算、引き算、掛け算、割り算をする
# 中級（任意）：四則演算のうち、どから1つを選択して実行できる
# 上級（任意）：自由課題 ※累乗や平方根など、オリジナルの機能を創意工夫してみよう
# 見本動画 → https://drive.google.com/drive/folders/1Pm2zJhQlMOwWik3tspaqOxRVymxTUlpr?usp=sharing
#
#-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-#
#
# 上の方の級が解けた場合は、下の方の級のコードは残しておかなくてもOKです
# （中級が解ける人は初級は解けるし、上級が解ける人は、初・中級は解けるでしょうから）
#
#-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-#
#
# 中級を解く際に、参考にしてほしいページをご紹介（公式ドキュメント）
# https://docs.streamlit.io/library/api-reference/widgets/st.radio
#
# 上級を解く際に、参考になるかもしれないサイトをご紹介
# https://blog.amedama.jp/entry/streamlit-tutorial
# https://data-analytics.fun/2022/01/29/understanding-streamlit-1/
#
#-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-#


### 課題コードの記入は「ここから」 ###



### 課題コードの記入は「ここまで」 ###


#=============================================================================#
# 提出方法：以下の項目を記入の上、Teamsの課題機能で、このコードファイルを提出する
# 学科：◯◯◯◯
# 学年：◯年
# 氏名：◯◯◯◯
#-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-#
